#!/usr/bin/python
# coding: UTF-8

#https://atcoder.jp/contests/abc007/tasks/abc007_1
#小学生のたかはし君は、遠足で林にきています。遠足を楽しんでいる彼は、木が一直線に並んでいることに
#気づきました。 そして、授業で、「植木算」というものを習ったことを思い出しました。彼が授業で習っ
#た植木算の問題は、「木が4本 一直線に並んでいるとき、隣り合う木の"間"は何箇所存在するか。」とい
#うもので、その答えは図1の通り3箇所です。

#今回、遠足中の彼が見ている光景は、その問題のシチュエーションとよく似通っていて、隣り合う木の間の
#数を数えたくなりました。 彼は遠足パンフレットに、一直線に生えている木々の本数が書かれていること
#に気づきました。しかし、彼は実際に木の間を数える手段しか知らないので、本数によってはとても時間が
#かかってしまうかもしれません。そこで、あなたにお願いがあります。 一直線に並んでいる木々がn本ある
#という情報が与えられるので、隣り合う木の間の数を出力するプログラムをたかはし君のために作ってあげ
#てください。

print(int(input())-1)
