maze=[[9,9,9,9,9,9,9,9,9,9,9,9],[9,0,0,0,9,0,0,0,0,0,0,9],[9,0,9,0,0,0,9,9,0,9,9,9],[9,0,9,9,0,9,0,0,0,9,0,9],[9,0,0,0,9,0,0,9,9,0,9,9],[9,9,9,0,0,9,0,9,0,0,0,9],[9,0,0,0,9,0,9,0,0,9,1,9],[9,0,9,0,0,0,0,9,0,0,9,9],[9,0,0,9,0,9,0,0,9,0,0,9],[9,0,9,0,9,0,9,0,0,9,0,9],[9,0,0,0,0,0,0,9,0,0,0,9],[9,9,9,9,9,9,9,9,9,9,9,9]]

import collections
pos = collections.deque([[1, 1, 0]])

def search(x, y, depth):
    if maze[x][y] == 1:
        print(depth)
        exit()
    maze[x][y] = 2

    if maze[x + 1][y] < 2:
        search(x + 1, y, depth + 1)
    if maze[x - 1][y] < 2:
        search(x - 1, y, depth + 1)
    if maze[x][y - 1] < 2:
        search(x, y - 1, depth + 1)
    if maze[x][y + 1] < 2:
        search(x, y  + 1, depth + 1)

    # 前の分岐まで戻って０（通過前）にする
    maze[x][y] = 0

search(1, 1, 0)
